<template>
  <div class="flex flex-col gap-2 w-full">
    <!-- header -->
    <div class="flex items-center h-11 w-full">
      <span>
        <svg
          width="2"
          height="20"
          viewBox="0 0 2 20"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <rect width="2" height="20" rx="1" fill="#002145" />
        </svg>
      </span>
      <span class="mx-5">
        {{ config.by_route(`${current_page}/title`) }}
      </span>
      <span
        ><svg
          width="82"
          height="25"
          viewBox="0 0 82 25"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <rect width="82" height="25" rx="3" fill="#F2F5F7" />
          <line x1="41.5" y1="4" x2="41.5" y2="21" stroke="#7D7D7D" />
          <path
            d="M11.9047 17H5.38196V16.09L8.82469 12.2655C9.33802 11.6842 9.69014 11.2133 9.88105 10.8527C10.0762 10.4879 10.1738 10.1124 10.1738 9.72636C10.1738 9.20879 10.0168 8.78455 9.70287 8.45364C9.38893 8.11848 8.96893 7.95091 8.44287 7.95091C7.81499 7.95091 7.32711 8.12909 6.97923 8.48545C6.63135 8.84182 6.45741 9.3403 6.45741 9.98091H5.19105C5.19105 9.06455 5.4859 8.32424 6.0756 7.76C6.66529 7.19151 7.45438 6.90727 8.44287 6.90727C9.36772 6.90727 10.0995 7.15121 10.6383 7.63909C11.1771 8.12273 11.4465 8.76758 11.4465 9.57364C11.4465 10.5536 10.8207 11.7203 9.56923 13.0736L6.90923 15.9691H11.9047V17ZM13.8224 12.0109L14.3315 7.04727H19.4287V8.21818H15.4006L15.1015 10.9291C15.5893 10.6406 16.143 10.4964 16.7624 10.4964C17.6703 10.4964 18.3893 10.7976 18.9197 11.4C19.4542 11.9982 19.7215 12.8085 19.7215 13.8309C19.7215 14.8533 19.4436 15.6594 18.8878 16.2491C18.3363 16.8388 17.5642 17.1336 16.5715 17.1336C15.6933 17.1336 14.9763 16.8918 14.4206 16.4082C13.8648 15.9203 13.5466 15.2458 13.466 14.3845H14.6624C14.743 14.953 14.9466 15.3815 15.2733 15.67C15.6 15.9585 16.0327 16.1027 16.5715 16.1027C17.1612 16.1027 17.6236 15.9033 17.9587 15.5045C18.2939 15.1015 18.4615 14.5479 18.4615 13.8436C18.4615 13.1776 18.279 12.643 17.9142 12.24C17.5536 11.837 17.0721 11.6355 16.4697 11.6355C15.9181 11.6355 15.4854 11.7564 15.1715 11.9982L14.8342 12.2718L13.8224 12.0109ZM27.3473 12.7555C27.3473 14.2361 27.0928 15.337 26.5837 16.0582C26.0789 16.7752 25.2898 17.1336 24.2164 17.1336C23.1516 17.1336 22.3646 16.7836 21.8555 16.0836C21.3464 15.3794 21.0834 14.3273 21.0664 12.9273V11.2345C21.0664 9.77515 21.3189 8.68909 21.8237 7.97636C22.3286 7.26364 23.1219 6.90727 24.2037 6.90727C25.2728 6.90727 26.0598 7.25091 26.5646 7.93818C27.0737 8.62545 27.3346 9.68394 27.3473 11.1136V12.7555ZM26.081 11.0245C26.081 9.95545 25.9304 9.17697 25.6292 8.68909C25.3279 8.19697 24.8528 7.95091 24.2037 7.95091C23.5546 7.95091 23.0816 8.19485 22.7846 8.68273C22.4876 9.17061 22.3349 9.91939 22.3264 10.9291V12.9527C22.3264 14.0303 22.4813 14.8258 22.791 15.3391C23.1049 15.8482 23.5801 16.1027 24.2164 16.1027C24.8401 16.1027 25.3025 15.863 25.6037 15.3836C25.9092 14.9 26.0683 14.1385 26.081 13.0991V11.0245ZM35.2087 12.7555C35.2087 14.2361 34.9541 15.337 34.445 16.0582C33.9402 16.7752 33.1511 17.1336 32.0778 17.1336C31.0129 17.1336 30.2259 16.7836 29.7169 16.0836C29.2078 15.3794 28.9447 14.3273 28.9278 12.9273V11.2345C28.9278 9.77515 29.1802 8.68909 29.685 7.97636C30.1899 7.26364 30.9832 6.90727 32.065 6.90727C33.1341 6.90727 33.9211 7.25091 34.4259 7.93818C34.935 8.62545 35.1959 9.68394 35.2087 11.1136V12.7555ZM33.9423 11.0245C33.9423 9.95545 33.7917 9.17697 33.4905 8.68909C33.1893 8.19697 32.7141 7.95091 32.065 7.95091C31.4159 7.95091 30.9429 8.19485 30.6459 8.68273C30.349 9.17061 30.1962 9.91939 30.1878 10.9291V12.9527C30.1878 14.0303 30.3426 14.8258 30.6523 15.3391C30.9662 15.8482 31.4414 16.1027 32.0778 16.1027C32.7014 16.1027 33.1638 15.863 33.465 15.3836C33.7705 14.9 33.9296 14.1385 33.9423 13.0991V11.0245Z"
            fill="#10CCAE"
          />
          <path
            d="M48.2211 11.4064H49.1692C49.7674 11.3979 50.2362 11.2409 50.5756 10.9355C50.9192 10.63 51.0911 10.2185 51.0911 9.70091C51.0911 8.53424 50.5098 7.95091 49.3474 7.95091C48.8001 7.95091 48.3632 8.10788 48.0365 8.42182C47.7141 8.73152 47.5529 9.14303 47.5529 9.65636H46.2865C46.2865 8.86727 46.575 8.21182 47.152 7.69C47.7289 7.16818 48.4607 6.90727 49.3474 6.90727C50.285 6.90727 51.0211 7.15758 51.5556 7.65818C52.0901 8.15455 52.3574 8.84394 52.3574 9.72636C52.3574 10.1591 52.2174 10.5791 51.9374 10.9864C51.6574 11.3894 51.2756 11.6927 50.792 11.8964C51.3392 12.0661 51.7614 12.3524 52.0583 12.7555C52.3553 13.1542 52.5038 13.6442 52.5038 14.2255C52.5038 15.1164 52.2111 15.8248 51.6256 16.3509C51.0444 16.8727 50.2871 17.1336 49.3538 17.1336C48.4204 17.1336 47.6611 16.8812 47.0756 16.3764C46.4901 15.8715 46.1974 15.2033 46.1974 14.3718H47.4701C47.4701 14.8979 47.6398 15.3179 47.9792 15.6318C48.3229 15.9458 48.7811 16.1027 49.3538 16.1027C49.9647 16.1027 50.4314 15.9436 50.7538 15.6255C51.0804 15.3073 51.2438 14.8491 51.2438 14.2509C51.2438 13.6739 51.0656 13.2306 50.7092 12.9209C50.3529 12.6112 49.8395 12.45 49.1692 12.4373H48.2211V11.4064ZM59.2069 7.04091V8.11636H58.9715C57.9872 8.13333 57.2024 8.42394 56.6169 8.98818C56.0357 9.55242 55.7006 10.3479 55.6115 11.3745C56.1333 10.7721 56.8481 10.4709 57.756 10.4709C58.6215 10.4709 59.313 10.7764 59.8306 11.3873C60.3481 11.9982 60.6069 12.7873 60.6069 13.7545C60.6069 14.777 60.3269 15.5958 59.7669 16.2109C59.2112 16.8261 58.4645 17.1336 57.5269 17.1336C56.5724 17.1336 55.7981 16.7688 55.2042 16.0391C54.6145 15.3094 54.3197 14.3676 54.3197 13.2136V12.73C54.3197 10.8973 54.71 9.49727 55.4906 8.53C56.2712 7.55848 57.4336 7.06212 58.9778 7.04091H59.2069ZM57.546 11.5273C57.1133 11.5273 56.7145 11.6567 56.3497 11.9155C55.9848 12.1742 55.7324 12.4988 55.5924 12.8891V13.3536C55.5924 14.1767 55.7769 14.8385 56.146 15.3391C56.5151 15.8397 56.9754 16.09 57.5269 16.09C58.0954 16.09 58.5409 15.88 58.8633 15.46C59.19 15.04 59.3533 14.4906 59.3533 13.8118C59.3533 13.1288 59.1878 12.5773 58.8569 12.1573C58.5303 11.7373 58.0933 11.5273 57.546 11.5273ZM68.3473 12.7555C68.3473 14.2361 68.0928 15.337 67.5837 16.0582C67.0789 16.7752 66.2898 17.1336 65.2164 17.1336C64.1516 17.1336 63.3646 16.7836 62.8555 16.0836C62.3464 15.3794 62.0834 14.3273 62.0664 12.9273V11.2345C62.0664 9.77515 62.3189 8.68909 62.8237 7.97636C63.3286 7.26364 64.1219 6.90727 65.2037 6.90727C66.2728 6.90727 67.0598 7.25091 67.5646 7.93818C68.0737 8.62545 68.3346 9.68394 68.3473 11.1136V12.7555ZM67.081 11.0245C67.081 9.95545 66.9304 9.17697 66.6292 8.68909C66.3279 8.19697 65.8528 7.95091 65.2037 7.95091C64.5546 7.95091 64.0816 8.19485 63.7846 8.68273C63.4876 9.17061 63.3349 9.91939 63.3264 10.9291V12.9527C63.3264 14.0303 63.4813 14.8258 63.791 15.3391C64.1049 15.8482 64.5801 16.1027 65.2164 16.1027C65.8401 16.1027 66.3025 15.863 66.6037 15.3836C66.9092 14.9 67.0683 14.1385 67.081 13.0991V11.0245ZM76.2087 12.7555C76.2087 14.2361 75.9541 15.337 75.445 16.0582C74.9402 16.7752 74.1511 17.1336 73.0778 17.1336C72.0129 17.1336 71.2259 16.7836 70.7169 16.0836C70.2078 15.3794 69.9447 14.3273 69.9278 12.9273V11.2345C69.9278 9.77515 70.1802 8.68909 70.685 7.97636C71.1899 7.26364 71.9832 6.90727 73.065 6.90727C74.1341 6.90727 74.9211 7.25091 75.4259 7.93818C75.935 8.62545 76.1959 9.68394 76.2087 11.1136V12.7555ZM74.9423 11.0245C74.9423 9.95545 74.7917 9.17697 74.4905 8.68909C74.1893 8.19697 73.7141 7.95091 73.065 7.95091C72.4159 7.95091 71.9429 8.19485 71.6459 8.68273C71.349 9.17061 71.1962 9.91939 71.1878 10.9291V12.9527C71.1878 14.0303 71.3426 14.8258 71.6523 15.3391C71.9662 15.8482 72.4414 16.1027 73.0778 16.1027C73.7014 16.1027 74.1638 15.863 74.465 15.3836C74.7705 14.9 74.9296 14.1385 74.9423 13.0991V11.0245Z"
            fill="#7D7D7D"
          />
        </svg>
      </span>
    </div>

    <!-- tabs -->
    <div class="flex flex-row items-center gap-8 p-2 w-72 justify-evenly">
      <button>{{ config.by_route(`${current_page}/tabs/business`) }}</button>
      <span class="bg-base-300 h-full w-[1px]"></span>
      <button class="text-primary">
        {{ config.by_route(`${current_page}/tabs/reports`) }}
      </button>
    </div>

    <!-- page content -->
    <div class="flex flex-col w-full px-4 gap-5 mt-2 py-2">
      <!-- route back -->
      <div class="flex flex-row items-center justify-start">
        <button
          class="flex items-center justify-between text-primary w-20 mx-2"
        >
          <svg
            width="15"
            height="16"
            viewBox="0 0 15 16"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M7.225 15.269C7.075 15.1188 7 14.9391 7 14.7301C7 14.5217 7.06667 14.3424 7.2 14.1921L12.5 8.90789H0.875C0.675 8.90789 0.5 8.83676 0.35 8.69451C0.2 8.55293 0.125 8.37362 0.125 8.15657C0.125 7.93952 0.2 7.75987 0.35 7.61762C0.5 7.47604 0.675 7.40525 0.875 7.40525H12.5L7.2 2.12099C7.06667 1.97073 7 1.79141 7 1.58305C7 1.37401 7.075 1.19436 7.225 1.0441C7.375 0.910534 7.55 0.84375 7.75 0.84375C7.95 0.84375 8.125 0.910534 8.275 1.0441L14.725 7.53047C14.825 7.61395 14.896 7.70978 14.938 7.81798C14.9793 7.92683 15 8.0397 15 8.15657C15 8.27344 14.9793 8.38597 14.938 8.49416C14.896 8.60302 14.825 8.69919 14.725 8.78267L8.275 15.269C8.125 15.4026 7.95 15.4694 7.75 15.4694C7.55 15.4694 7.375 15.4026 7.225 15.269Z"
              fill="#0A65CD"
            />
          </svg>
          <span>
            {{ config.by_route(`${current_page}/back`) }}
          </span>
        </button>
      </div>

      <!-- speed page section -->
      <section class="w-full border rounded-lg flex flex-col gap-5 pt-2 pb-4">
        <!-- title -->
        <span class="p-3">{{
          config.by_route(`${current_page}/sections/page-speed/title`)
        }}</span>
        <!-- the page detail -->
        <div class="flex flex-row items-center justify-evenly">
          <div class="w-36 h-36 flex items-center justify-center">
            <RadialProgress :value="90" />
          </div>
          <div class="flex flex-col justify-between h-full w-1/2 py-4">
            <span class="text-xl">شرکت زانکو نویان Xaankoo Noyan</span>
            <p class="font-thin text-base-500">
              شرکت زانکو نویان Xaankoo Noyan - ارائه محصولات نوآور برای افزایش
              بهره‌وری شرکت‌ها، کارکنان و تیم‌ها
            </p>
            <NuxtLink
              to="https://xaankoo.com/"
              class="text-primary flex justify-end"
              style="direction: ltr"
              >https://xaankoo.com/</NuxtLink
            >
          </div>
          <ToolsSplitHorizontal class="h-full my-2" />
          <div class="border rounded-md h-40 w-64"></div>
        </div>

        <!-- problems -->
        <div
          class="grid grid-cols-2 w-full justify-evenly gap-8 px-4 py-2 h-40"
        >
          <div class="flex flex-col gap-2 justify-evenly rounded-lg w-full">
            <div class="flex flex-row items-center justify-between">
              <div class="flex flex-row gap-4 items-center">
                <span class="mask mask-triangle w-6 h-6 bg-error">&nbsp;</span>
                <span>{{
                  config.by_route(
                    `${current_page}/sections/page-speed/problems/high`
                  )
                }}</span>
              </div>
              <span
                class="rounded-full w-20 bg-base-400 flex items-center justify-center text-white"
              >
                5 مورد
              </span>
            </div>
            <div class="h-2 w-full mx-auto bg-error rounded-lg"></div>
          </div>
          <div class="flex flex-col gap-2 justify-evenly rounded-lg w-full">
            <div class="flex flex-row items-center justify-between">
              <div class="flex flex-row gap-4 items-center">
                <span class="mask mask-square w-6 h-6 bg-amber-400"
                  >&nbsp;</span
                >
                <span>{{
                  config.by_route(
                    `${current_page}/sections/page-speed/problems/middle`
                  )
                }}</span>
              </div>
              <span
                class="rounded-full w-20 bg-base-400 flex items-center justify-center text-white"
              >
                5 مورد
              </span>
            </div>
            <div class="h-2 w-full mx-auto bg-amber-400 rounded-lg"></div>
          </div>
          <div class="flex flex-col gap-2 justify-evenly rounded-lg w-full">
            <div class="flex flex-row items-center justify-between">
              <div class="flex flex-row gap-4 items-center">
                <span class="mask mask-circle w-6 h-6 bg-base-500">&nbsp;</span>
                <span>{{
                  config.by_route(
                    `${current_page}/sections/page-speed/problems/low`
                  )
                }}</span>
              </div>
              <span
                class="rounded-full w-20 bg-base-400 flex items-center justify-center text-white"
              >
                5 مورد
              </span>
            </div>
            <div class="h-2 w-full mx-auto bg-base-500 rounded-lg"></div>
          </div>
          <div class="flex flex-col gap-2 justify-evenly rounded-lg w-full">
            <div class="flex flex-row items-center justify-between">
              <div class="flex flex-row gap-4 items-center">
                <span class="mask mask-triangle w-6 h-6 bg-success"
                  >&nbsp;</span
                >
                <span>{{
                  config.by_route(
                    `${current_page}/sections/page-speed/problems/solved`
                  )
                }}</span>
              </div>
              <span
                class="rounded-full w-20 bg-base-400 flex items-center justify-center text-white"
              >
                5 مورد
              </span>
            </div>
            <div class="h-2 w-full mx-auto bg-success rounded-lg"></div>
          </div>
        </div>

        <!-- analysts -->
        <div class="flex flex-row items-center justify-evenly">
          <span class="flex flex-row items-center gap-4">
            <span
              class="rounded-sm bg-base-350 flex items-center justify-center p-2"
            >
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  opacity="0.975"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M23.9745 12.3038C23.9745 12.7412 23.9745 13.1788 23.9745 13.6163C23.7335 16.9184 22.4053 19.6918 19.9901 21.9366C19.2445 22.5122 18.4008 22.856 17.4589 22.9678C13.8183 22.9991 10.1777 22.9991 6.53702 22.9678C5.55748 22.855 4.68248 22.4957 3.91202 21.8897C1.12733 19.2413 -0.161739 15.9835 0.0448364 12.1163C0.40816 8.38032 2.08785 5.40376 5.0839 3.18657C8.59601 0.869167 12.346 0.400419 16.3339 1.78032C20.0124 3.27124 22.4108 5.91966 23.5292 9.72563C23.759 10.578 23.9074 11.4373 23.9745 12.3038ZM11.5526 2.97563C15.5169 2.98435 18.5404 4.65623 20.623 7.99126C22.2551 11.0084 22.3801 14.0865 20.998 17.2256C20.4232 18.4102 19.6497 19.4492 18.6776 20.3428C18.1521 20.742 17.5584 20.9451 16.8964 20.9522C13.6151 20.9835 10.3339 20.9835 7.05265 20.9522C6.39659 20.9262 5.80287 20.7231 5.2714 20.3428C2.54197 17.7009 1.53415 14.5057 2.24796 10.7569C3.20955 7.09215 5.48299 4.64685 9.06827 3.42094C9.88709 3.18256 10.7152 3.03412 11.5526 2.97563Z"
                  fill="white"
                />
                <path
                  opacity="0.971"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M11.5533 4.94598C14.6656 4.91195 17.0796 6.17757 18.7955 8.74286C20.1737 11.1204 20.3612 13.5892 19.358 16.1491C18.9082 17.1508 18.291 18.0336 17.5064 18.7975C16.7997 19.1713 16.2607 19.0072 15.8892 18.3054C15.8257 17.9737 15.8725 17.6612 16.0299 17.3679C17.9547 15.4472 18.4234 13.2128 17.4361 10.6647C16.0561 7.85317 13.7983 6.64225 10.6627 7.03192C9.96963 6.68715 9.78991 6.1637 10.1236 5.46161C10.2637 5.27453 10.4434 5.14173 10.6627 5.06317C10.9668 5.02642 11.2637 4.98737 11.5533 4.94598Z"
                  fill="white"
                />
                <path
                  opacity="0.973"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M6.77321 6.95904C7.05601 6.93396 7.32161 6.98866 7.57009 7.1231C8.85132 8.40433 10.1326 9.68562 11.4138 10.9668C12.7514 10.7905 13.6029 11.3452 13.9685 12.6309C14.0755 13.8356 13.5521 14.6091 12.3982 14.9512C11.126 15.0998 10.3214 14.5608 9.98415 13.334C9.96146 13.0354 9.96146 12.7385 9.98415 12.4434C8.71853 11.1778 7.4529 9.91216 6.18728 8.64654C5.77365 7.86372 5.96898 7.30122 6.77321 6.95904Z"
                  fill="white"
                />
                <path
                  opacity="0.968"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M4.84823 10.9469C5.58946 10.9182 5.99573 11.2698 6.06698 12.0016C5.78877 14.1047 6.40598 15.8937 7.91854 17.3688C8.23307 17.9818 8.11588 18.4896 7.56698 18.8922C7.23885 19.0485 6.91073 19.0485 6.5826 18.8922C4.649 17.093 3.78182 14.8665 3.98104 12.2126C3.95342 11.5624 4.24248 11.1405 4.84823 10.9469Z"
                  fill="white"
                />
              </svg>
            </span>
            <span>1.67 ثانیه</span>
          </span>
          <span class="flex flex-row items-center gap-4">
            <span
              class="rounded-sm bg-base-350 flex items-center justify-center p-2"
            >
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_5619_11261)">
                  <path
                    opacity="0.978"
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M11.6484 -0.0234375C11.8672 -0.0234375 12.0859 -0.0234375 12.3047 -0.0234375C12.6561 0.132895 12.8827 0.39852 12.9844 0.773438C13.0078 1.16375 13.0156 1.55437 13.0078 1.94531C14.7891 1.9375 16.5704 1.94531 18.3516 1.96875C19.5338 2.12001 20.3697 2.73719 20.8594 3.82031C21.8953 6.77981 22.9343 9.73294 23.9766 12.6797C23.9766 13.1016 23.9766 13.5234 23.9766 13.9453C23.7314 15.6042 22.872 16.8307 21.3984 17.625C20.188 18.0763 18.9693 18.0919 17.7422 17.6719C15.6721 16.6493 14.7581 14.9853 15 12.6797C16.0534 9.79275 17.0925 6.90216 18.1172 4.00781C16.4141 4.00781 14.7109 4.00781 13.0078 4.00781C13.0078 9.9922 13.0078 15.9765 13.0078 21.9609C15.086 21.9531 17.1641 21.9609 19.2422 21.9844C19.8876 22.2362 20.1142 22.6972 19.9219 23.3672C19.7939 23.6607 19.583 23.8639 19.2891 23.9766C14.4141 23.9766 9.53906 23.9766 4.66406 23.9766C3.97744 23.6278 3.79775 23.0965 4.125 22.3828C4.26996 22.1752 4.46527 22.0425 4.71094 21.9844C6.789 21.9609 8.86711 21.9531 10.9453 21.9609C10.9453 15.9765 10.9453 9.9922 10.9453 4.00781C9.2422 4.00781 7.53905 4.00781 5.83594 4.00781C6.86063 6.90216 7.8997 9.79275 8.95312 12.6797C9.19317 14.9424 8.31033 16.5908 6.30469 17.625C4.29318 18.3818 2.55099 17.9834 1.07812 16.4297C0.497723 15.7113 0.130536 14.8988 -0.0234375 13.9922C-0.0234375 13.5547 -0.0234375 13.1172 -0.0234375 12.6797C1.0188 9.73294 2.05786 6.77981 3.09375 3.82031C3.58345 2.73719 4.41938 2.12001 5.60156 1.96875C7.38277 1.94531 9.16402 1.9375 10.9453 1.94531C10.9375 1.55437 10.9453 1.16375 10.9688 0.773438C11.0704 0.39852 11.297 0.132895 11.6484 -0.0234375ZM4.38281 6.30469C4.46644 6.35503 4.52112 6.43313 4.54688 6.53906C5.20969 8.34787 5.85811 10.1604 6.49219 11.9766C5.13272 11.9844 3.77335 11.9766 2.41406 11.9531C3.09371 10.0783 3.74996 8.19544 4.38281 6.30469ZM19.4766 6.30469C19.5602 6.35503 19.6149 6.43313 19.6406 6.53906C20.2737 8.34455 20.9065 10.1492 21.5391 11.9531C20.1798 11.9766 18.8204 11.9844 17.4609 11.9766C18.1236 10.0824 18.7955 8.19178 19.4766 6.30469ZM2.13281 13.9922C3.71094 13.9922 5.28905 13.9922 6.86719 13.9922C6.54216 15.2107 5.74528 15.867 4.47656 15.9609C3.56678 15.8927 2.87147 15.4709 2.39062 14.6953C2.26244 14.4747 2.1765 14.2403 2.13281 13.9922ZM17.0859 13.9922C18.6641 13.9922 20.2422 13.9922 21.8203 13.9922C21.5825 14.8787 21.0356 15.4959 20.1797 15.8438C18.9851 16.1095 18.0398 15.7423 17.3438 14.7422C17.2061 14.509 17.1202 14.259 17.0859 13.9922Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_5619_11261">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </span>
            <span> 38.72 کیلوبایت </span>
          </span>
          <span class="flex flex-row items-center gap-4">
            <span
              class="rounded-sm bg-base-350 flex items-center justify-center p-2"
            >
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_5619_11255)">
                  <path
                    opacity="0.979"
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M11.2745 -0.0234375C11.7432 -0.0234375 12.212 -0.0234375 12.6807 -0.0234375C13.3769 0.0975187 14.0331 0.339706 14.6495 0.703125C16.8214 1.99208 18.9776 3.30458 21.1182 4.64062C22.0887 5.44102 22.6903 6.46448 22.9229 7.71094C22.9763 9.13144 22.9998 10.5533 22.9932 11.9766C22.9998 13.3998 22.9763 14.8217 22.9229 16.2422C22.6125 17.7545 21.8078 18.9186 20.5089 19.7344C18.548 20.8944 16.5949 22.0663 14.6495 23.25C14.0331 23.6134 13.3769 23.8556 12.6807 23.9766C12.212 23.9766 11.7432 23.9766 11.2745 23.9766C10.5784 23.8556 9.92211 23.6134 9.30575 23.25C7.13389 21.961 4.97764 20.6485 2.837 19.3125C1.86648 18.5121 1.26491 17.4886 1.03231 16.2422C0.978926 14.8217 0.955488 13.3998 0.961999 11.9766C0.955488 10.5533 0.978926 9.13144 1.03231 7.71094C1.34275 6.19866 2.14744 5.03456 3.44637 4.21875C5.40725 3.05867 7.36039 1.88679 9.30575 0.703125C9.92211 0.339706 10.5784 0.0975187 11.2745 -0.0234375ZM14.2276 2.88281C15.9828 3.909 17.7327 4.94808 19.4776 6C19.718 6.15455 19.9367 6.33422 20.1339 6.53906C19.1839 7.13517 18.2229 7.71328 17.2511 8.27344C16.2195 6.49177 15.2117 4.69491 14.2276 2.88281ZM9.68075 2.92969C8.77601 4.64528 7.84634 6.34842 6.89169 8.03906C6.84003 8.12723 6.77755 8.20537 6.70419 8.27344C5.75562 7.68572 4.79469 7.11544 3.82137 6.5625C3.9768 6.39159 4.14867 6.23536 4.337 6.09375C6.11309 5.02617 7.89434 3.97149 9.68075 2.92969ZM11.9776 3.11719C13.0544 5.05177 14.1326 6.98925 15.212 8.92969C13.0557 8.99217 10.8995 8.99217 8.74325 8.92969C9.82194 6.99089 10.9001 5.05341 11.9776 3.11719ZM20.9307 8.46094C20.9853 10.2499 20.9931 12.0468 20.9542 13.8516C20.0714 12.5938 19.1885 11.3359 18.3057 10.0781C19.1759 9.52612 20.0509 8.98706 20.9307 8.46094ZM3.0245 8.50781C3.92978 8.99161 4.80476 9.52284 5.6495 10.1016C4.7667 11.3985 3.88387 12.6953 3.00106 13.9922C3.01843 12.1645 3.02625 10.3364 3.0245 8.50781ZM8.837 11.0391C10.9228 10.9845 13.0166 10.9767 15.1182 11.0156C14.0772 12.6836 13.0303 14.3477 11.9776 16.0078C10.9296 14.3485 9.88273 12.6923 8.837 11.0391ZM6.91512 11.8359C7.77022 13.2153 8.63741 14.5903 9.51669 15.9609C9.65755 16.1963 9.78256 16.4306 9.89169 16.6641C7.9482 16.4717 6.00289 16.2764 4.05575 16.0781C5.02723 14.6735 5.98034 13.2594 6.91512 11.8359ZM16.9932 11.8828C17.115 11.9674 17.2166 12.0768 17.2979 12.2109C18.1781 13.5129 19.0766 14.802 19.9932 16.0781C18.0114 16.2895 16.027 16.4614 14.0401 16.5938C15.0426 15.0339 16.027 13.4636 16.9932 11.8828ZM5.04012 18.3047C5.08461 18.2741 5.13927 18.2585 5.20419 18.2578C7.11659 18.4508 9.03069 18.6227 10.9464 18.7734C10.9542 19.7736 10.9464 20.7735 10.9229 21.7734C8.96328 20.6102 7.00231 19.454 5.04012 18.3047ZM18.6339 18.2578C18.7289 18.2502 18.8226 18.258 18.9151 18.2812C16.9664 19.464 15.0055 20.628 13.0323 21.7734C13.0089 20.7735 13.001 19.7736 13.0089 18.7734C14.8922 18.6179 16.7672 18.446 18.6339 18.2578Z"
                    fill="white"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_5619_11255">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </span>
            <span> 64 منبع </span>
          </span>
          <span class="flex flex-row items-center gap-4">
            <span
              class="rounded-sm bg-base-350 flex items-center justify-center p-2"
            >
              <svg
                width="22"
                height="24"
                viewBox="0 0 22 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  opacity="0.975"
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M10.1797 -0.0234375C10.7109 -0.0234375 11.2422 -0.0234375 11.7734 -0.0234375C14.7936 0.468428 16.7858 2.17155 17.75 5.08594C17.8245 5.39602 17.887 5.70853 17.9375 6.02344C17.9836 6.8198 18.0226 7.61667 18.0547 8.41406C19.7891 9.26667 20.7657 10.6573 20.9844 12.5859C21.0156 14.8359 21.0156 17.0859 20.9844 19.3359C20.7595 21.3414 19.736 22.7711 17.9141 23.625C17.4963 23.7801 17.0744 23.8972 16.6484 23.9766C12.8672 23.9766 9.08595 23.9766 5.30469 23.9766C3.36138 23.6197 2.00982 22.5259 1.25 20.6953C1.09696 20.2706 1.00321 19.8331 0.968751 19.3828C0.9375 17.1172 0.9375 14.8515 0.968751 12.5859C1.18371 10.6546 2.16027 9.26405 3.89844 8.41406C3.9305 7.61667 3.96955 6.8198 4.01563 6.02344C4.51053 3.18136 6.11211 1.2673 8.82031 0.28125C9.27374 0.151655 9.72683 0.050092 10.1797 -0.0234375ZM10.6016 1.99219C12.7001 1.95901 14.286 2.83402 15.3594 4.61719C15.8744 5.66733 16.0698 6.77667 15.9453 7.94531C12.6328 7.94531 9.32033 7.94531 6.00781 7.94531C5.7732 5.71528 6.57008 3.9731 8.39844 2.71875C9.08788 2.31964 9.82227 2.07745 10.6016 1.99219ZM5.53906 10.0078C9.16409 9.99998 12.7891 10.0078 16.4141 10.0312C17.3723 10.2084 18.0989 10.7162 18.5938 11.5547C18.7593 11.8638 18.8687 12.192 18.9219 12.5391C18.9531 14.8203 18.9531 17.1015 18.9219 19.3828C18.6215 20.8394 17.7388 21.6909 16.2734 21.9375C12.7422 21.9688 9.21092 21.9688 5.67969 21.9375C4.21438 21.6909 3.33157 20.8394 3.03125 19.3828C3 17.1015 3 14.8203 3.03125 12.5391C3.34441 11.1713 4.18034 10.3275 5.53906 10.0078Z"
                  fill="white"
                />
              </svg>
            </span>
            <span> امن </span>
          </span>
        </div>

        <hr class="mx-4 border-base-300 h-[2px]" />
        <!-- criterion -->
        <div class="flex flex-col gap-2 px-4">
          <label>{{
            config.by_route(`${current_page}/sections/page-speed/criterion`)
          }}</label>

          <!-- data analyze -->
          <div class="grid grid-cols-2 gap-4">
            <hr />
            <hr />
            <div class="flex flex-row justify-between items-center">
              <span class="flex flex-row items-center gap-4">
                <span class="mask mask-square bg-amber-400 w-6 h-6"
                  >&nbsp;</span
                >
                <span>Time to Interactive</span>
              </span>
              <span class="text-error text-sm">3.4 ثانیه</span>
            </div>
            <div class="flex flex-row justify-between items-center">
              <span class="flex flex-row items-center gap-4">
                <span class="mask mask-triangle bg-error w-6 h-6">&nbsp;</span>
                <span>First Contentful Paint</span>
              </span>
              <span class="text-error text-sm">3.4 ثانیه</span>
            </div>
            <hr />
            <hr />
            <div class="flex flex-row justify-between items-center">
              <span class="flex flex-row items-center gap-4">
                <span class="mask mask-circle bg-success w-6 h-6">&nbsp;</span>
                <span>Total Blocking Time</span>
              </span>
              <span class="text-error text-sm">12 میلی ثانیه</span>
            </div>
            <div class="flex flex-row justify-between items-center">
              <span class="flex flex-row items-center gap-4">
                <span class="mask mask-triangle bg-error w-6 h-6">&nbsp;</span>
                <span>Speed Index</span>
              </span>
              <span class="text-error text-sm">3.4 ثانیه</span>
            </div>
            <hr />
            <hr />
            <div class="flex flex-row justify-between items-center">
              <span class="flex flex-row items-center gap-4">
                <span class="mask mask-square bg-amber-400 w-6 h-6"
                  >&nbsp;</span
                >
                <span>Cumulative Layout Shift</span>
              </span>
              <span class="text-error text-sm">3.4 ثانیه</span>
            </div>
            <div class="flex flex-row justify-between items-center">
              <span class="flex flex-row items-center gap-4">
                <span class="mask mask-triangle bg-error w-6 h-6">&nbsp;</span>
                <span>Largest Contentful Paint</span>
              </span>
              <span class="text-error text-sm">3.4 ثانیه</span>
            </div>
            <hr />
            <hr />
          </div>

          <!-- radial analyze -->
          <div class="flex flex-row justify-evenly my-4 items-center">
            <div class="flex flex-col items-center gap-4">
              <span
                class="w-32 h-32 bg-success mask mask-circle flex items-center justify-center"
              >
                <RadialProgress :value="80" />
              </span>
              <span>{{
                config.by_route(`${current_page}/sections/page-speed/function`)
              }}</span>
            </div>
            <div class="flex flex-col items-center gap-4">
              <span
                class="w-32 h-32 bg-success mask mask-circle flex items-center justify-center"
              >
                <RadialProgress :value="80" />
              </span>
              <span>{{
                config.by_route(`${current_page}/sections/page-speed/available`)
              }}</span>
            </div>
            <div class="flex flex-col items-center gap-4">
              <span
                class="w-32 h-32 bg-success mask mask-circle flex items-center justify-center"
              >
                <RadialProgress :value="80" />
              </span>
              <span>{{
                config.by_route(
                  `${current_page}/sections/page-speed/important_criterion`
                )
              }}</span>
            </div>
            <div class="flex flex-col items-center gap-4">
              <span
                class="w-32 h-32 bg-success mask mask-circle flex items-center justify-center"
              >
                <RadialProgress :value="80" />
              </span>
              <span>{{
                config.by_route(`${current_page}/sections/page-speed/seo`)
              }}</span>
            </div>
          </div>

          <!-- load order -->
          <div class="flex flex-col gap-4">
            <span>{{
              config.by_route(`${current_page}/sections/page-speed/order`)
            }}</span>
            <div class="flex flex-row items-center justify-evenly">
              <div
                class="w-28 h-40 border rounded-sm"
                v-for="i in 8"
                :key="i"
              ></div>
            </div>
          </div>
        </div>
      </section>

      <!-- technical analysis section -->
      <section class="w-full border rounded-lg flex flex-col gap-5 pt-2 pb-4">
        <!-- title -->
        <label class="p-3">{{
          config.by_route(`${technical_section}/title`)
        }}</label>

        <!-- content section -->

        <div class="flex flex-col w-full gap-7 px-3">
          <!-- this must designed as widget -->
          <div class="grid grid-cols-8 items-start gap-5 w-full">
            <!-- title -->
            <div class="flex flex-row items-center gap-4 col-span-2">
              <span class="mask mask-triangle w-6 h-6 bg-success">&nbsp;</span>
              <span>{{
                config.by_route(`${technical_section}/tag-title`)
              }}</span>
            </div>
            <!-- description -->
            <div class="flex flex-col col-span-5 gap-2 w-8/12 font-thin">
              <p>آنالیز کامل سایت - آنالیز سئو - بررسی سایت - بررسی سئو سایت</p>
              <span class="flex flex-row items-center gap-5">
                <label class="font-semibold">طول: </label>
                <span>255 حرف</span>
              </span>
            </div>
            <!-- spinner -->
            <span class="h-full flex items-center justify-end">
              <svg
                width="20"
                height="12"
                viewBox="0 0 20 12"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M18.925 2.65156L10.625 10.9766C10.5417 11.0599 10.4457 11.1222 10.337 11.1636C10.229 11.2056 10.1167 11.2266 10 11.2266C9.88333 11.2266 9.77067 11.2056 9.662 11.1636C9.554 11.1222 9.45833 11.0599 9.375 10.9766L1.05 2.65156C0.85 2.45156 0.75 2.21823 0.75 1.95156C0.75 1.6849 0.858333 1.44323 1.075 1.22656C1.25833 1.02656 1.48733 0.926563 1.762 0.926563C2.03733 0.926563 2.275 1.02656 2.475 1.22656L10 8.77656L17.55 1.22656C17.7333 1.04323 17.9583 0.951562 18.225 0.951562C18.4917 0.951562 18.725 1.05156 18.925 1.25156C19.125 1.45156 19.225 1.6849 19.225 1.95156C19.225 2.21823 19.125 2.45156 18.925 2.65156Z"
                  fill="#002145"
                />
              </svg>
            </span>
            <!-- paragraph -->
            <p class="text-base-500 col-span-8 mx-auto w-10/12">
              تگ عنوان عنصر HTML است که عنوان صفحه وب را مشخص می کند. تگ عنوان
              در بالای مرورگر شما، در نتایج جستجو و همچنین در نوار نشانک ها
              نمایش داده می شود.
            </p>
          </div>

          <hr />
          <!-- this must designed as widget -->
          <div class="grid grid-cols-8 items-start gap-5 w-full">
            <!-- title -->
            <div class="flex flex-row items-center gap-4 col-span-2">
              <span class="mask mask-triangle w-6 h-6 bg-success">&nbsp;</span>
              <span>{{
                config.by_route(`${technical_section}/meta-description`)
              }}</span>
            </div>

            <!-- description -->
            <div class="flex flex-col gap-2 font-thin col-span-5">
              <p>
                چکاپ تولز یک سایت جامع برای آنالیز سئو و سرعت سایت شما می باشد
                که با بیش از 60 ابزار مختلف سایت شما را بررسی میکند و نیاز اصلی
                هر وبمستر می باشد .
              </p>
              <span class="flex flex-row items-center gap-5">
                <label class="font-semibold">طول: </label>
                <span>255 حرف</span>
              </span>
            </div>

            <!-- spinner -->
            <span class="h-full flex items-center justify-end">
              <svg
                width="20"
                height="12"
                viewBox="0 0 20 12"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M18.925 2.65156L10.625 10.9766C10.5417 11.0599 10.4457 11.1222 10.337 11.1636C10.229 11.2056 10.1167 11.2266 10 11.2266C9.88333 11.2266 9.77067 11.2056 9.662 11.1636C9.554 11.1222 9.45833 11.0599 9.375 10.9766L1.05 2.65156C0.85 2.45156 0.75 2.21823 0.75 1.95156C0.75 1.6849 0.858333 1.44323 1.075 1.22656C1.25833 1.02656 1.48733 0.926563 1.762 0.926563C2.03733 0.926563 2.275 1.02656 2.475 1.22656L10 8.77656L17.55 1.22656C17.7333 1.04323 17.9583 0.951562 18.225 0.951562C18.4917 0.951562 18.725 1.05156 18.925 1.25156C19.125 1.45156 19.225 1.6849 19.225 1.95156C19.225 2.21823 19.125 2.45156 18.925 2.65156Z"
                  fill="#002145"
                />
              </svg>
            </span>
            <!-- paragraph -->
            <p class="text-base-500 col-span-8 w-10/12 mx-auto">
              توضیحات متا یک تگ HTML است که خلاصه ای کوتاه و دقیق از صفحه وب
              ارائه می دهد. توضیحات متا توسط موتورهای جستجو برای شناسایی موضوع
              صفحه وب و ارائه نتایج جستجوی مرتبط استفاده می شود.
            </p>
          </div>

          <hr />

          <!-- this must designed as widget -->
          <div class="grid grid-cols-8 items-start gap-5 w-full">
            <!-- title -->
            <div class="flex flex-row items-center gap-4 col-span-2">
              <span class="mask mask-triangle w-6 h-6 bg-error">&nbsp;</span>
              <span>{{
                config.by_route(`${technical_section}/headings`)
              }}</span>
            </div>

            <!-- description -->
            <div class="flex flex-col gap-5 col-span-5 font-thin">
              <p>فقط یک تگ h1 باید در صفحه وب وجود داشته باشد.</p>

              <!-- table  -->
              <div class="border rounded-sm flex flex-col w-10/12">
                <div
                  class="flex flex-row items-center justify-between px-3 py-2"
                >
                  <!-- tag -->
                  <span>h1</span>

                  <span class="flex flex-row items-center gap-2">
                    <span
                      class="bg-base-350 text-base-500 rounded-full px-3 py-1 text-sm"
                      >9 مورد</span
                    >
                    <span>
                      <svg
                        width="12"
                        height="7"
                        viewBox="0 0 12 7"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M0.796355 5.94739L5.63802 1.09115C5.68663 1.04253 5.74263 1.00617 5.80602 0.982062C5.86902 0.957562 5.93455 0.945312 6.0026 0.945312C6.07066 0.945312 6.13638 0.957562 6.19977 0.982062C6.26277 1.00617 6.31858 1.04253 6.36719 1.09115L11.2234 5.9474C11.3401 6.06406 11.3984 6.20017 11.3984 6.35573C11.3984 6.51128 11.3352 6.65226 11.2089 6.77865C11.1019 6.89531 10.9683 6.95365 10.8081 6.95365C10.6475 6.95365 10.5089 6.89531 10.3922 6.77865L6.0026 2.37448L1.59844 6.77865C1.49149 6.88559 1.36024 6.93906 1.20469 6.93906C1.04913 6.93906 0.913022 6.88073 0.796355 6.76406C0.679688 6.64739 0.621354 6.51128 0.621354 6.35573C0.621354 6.20017 0.679688 6.06406 0.796355 5.94739Z"
                          fill="#002145"
                        />
                      </svg>
                    </span>
                  </span>
                </div>
                <hr />
                <div
                  class="flex flex-row items-center justify-between px-3 py-2"
                >
                  <!-- tag -->
                  <span>h1</span>

                  <span class="flex flex-row items-center gap-2">
                    <span
                      class="bg-base-350 text-base-500 rounded-full px-3 py-1 text-sm"
                      >9 مورد</span
                    >
                    <span>
                      <svg
                        width="12"
                        height="7"
                        viewBox="0 0 12 7"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M0.796355 5.94739L5.63802 1.09115C5.68663 1.04253 5.74263 1.00617 5.80602 0.982062C5.86902 0.957562 5.93455 0.945312 6.0026 0.945312C6.07066 0.945312 6.13638 0.957562 6.19977 0.982062C6.26277 1.00617 6.31858 1.04253 6.36719 1.09115L11.2234 5.9474C11.3401 6.06406 11.3984 6.20017 11.3984 6.35573C11.3984 6.51128 11.3352 6.65226 11.2089 6.77865C11.1019 6.89531 10.9683 6.95365 10.8081 6.95365C10.6475 6.95365 10.5089 6.89531 10.3922 6.77865L6.0026 2.37448L1.59844 6.77865C1.49149 6.88559 1.36024 6.93906 1.20469 6.93906C1.04913 6.93906 0.913022 6.88073 0.796355 6.76406C0.679688 6.64739 0.621354 6.51128 0.621354 6.35573C0.621354 6.20017 0.679688 6.06406 0.796355 5.94739Z"
                          fill="#002145"
                        />
                      </svg>
                    </span>
                  </span>
                </div>
                <hr />
                <div
                  class="flex flex-row items-center justify-between px-3 py-2"
                >
                  <!-- tag -->
                  <span>h1</span>

                  <span class="flex flex-row items-center gap-2">
                    <span
                      class="bg-base-350 text-base-500 rounded-full px-3 py-1 text-sm"
                      >9 مورد</span
                    >
                    <span>
                      <svg
                        width="12"
                        height="7"
                        viewBox="0 0 12 7"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M0.796355 5.94739L5.63802 1.09115C5.68663 1.04253 5.74263 1.00617 5.80602 0.982062C5.86902 0.957562 5.93455 0.945312 6.0026 0.945312C6.07066 0.945312 6.13638 0.957562 6.19977 0.982062C6.26277 1.00617 6.31858 1.04253 6.36719 1.09115L11.2234 5.9474C11.3401 6.06406 11.3984 6.20017 11.3984 6.35573C11.3984 6.51128 11.3352 6.65226 11.2089 6.77865C11.1019 6.89531 10.9683 6.95365 10.8081 6.95365C10.6475 6.95365 10.5089 6.89531 10.3922 6.77865L6.0026 2.37448L1.59844 6.77865C1.49149 6.88559 1.36024 6.93906 1.20469 6.93906C1.04913 6.93906 0.913022 6.88073 0.796355 6.76406C0.679688 6.64739 0.621354 6.51128 0.621354 6.35573C0.621354 6.20017 0.679688 6.06406 0.796355 5.94739Z"
                          fill="#002145"
                        />
                      </svg>
                    </span>
                  </span>
                </div>
                <hr />
                <div
                  class="flex flex-row items-center justify-between px-3 py-2"
                >
                  <!-- tag -->
                  <span>h1</span>

                  <span class="flex flex-row items-center gap-2">
                    <span
                      class="bg-base-350 text-base-500 rounded-full px-3 py-1 text-sm"
                      >9 مورد</span
                    >
                    <span>
                      <svg
                        width="12"
                        height="7"
                        viewBox="0 0 12 7"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M0.796355 5.94739L5.63802 1.09115C5.68663 1.04253 5.74263 1.00617 5.80602 0.982062C5.86902 0.957562 5.93455 0.945312 6.0026 0.945312C6.07066 0.945312 6.13638 0.957562 6.19977 0.982062C6.26277 1.00617 6.31858 1.04253 6.36719 1.09115L11.2234 5.9474C11.3401 6.06406 11.3984 6.20017 11.3984 6.35573C11.3984 6.51128 11.3352 6.65226 11.2089 6.77865C11.1019 6.89531 10.9683 6.95365 10.8081 6.95365C10.6475 6.95365 10.5089 6.89531 10.3922 6.77865L6.0026 2.37448L1.59844 6.77865C1.49149 6.88559 1.36024 6.93906 1.20469 6.93906C1.04913 6.93906 0.913022 6.88073 0.796355 6.76406C0.679688 6.64739 0.621354 6.51128 0.621354 6.35573C0.621354 6.20017 0.679688 6.06406 0.796355 5.94739Z"
                          fill="#002145"
                        />
                      </svg>
                    </span>
                  </span>
                </div>
              </div>
            </div>

            <!-- spinner -->
            <span class="h-full flex items-center justify-end">
              <svg
                width="20"
                height="12"
                viewBox="0 0 20 12"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M18.925 2.65156L10.625 10.9766C10.5417 11.0599 10.4457 11.1222 10.337 11.1636C10.229 11.2056 10.1167 11.2266 10 11.2266C9.88333 11.2266 9.77067 11.2056 9.662 11.1636C9.554 11.1222 9.45833 11.0599 9.375 10.9766L1.05 2.65156C0.85 2.45156 0.75 2.21823 0.75 1.95156C0.75 1.6849 0.858333 1.44323 1.075 1.22656C1.25833 1.02656 1.48733 0.926563 1.762 0.926563C2.03733 0.926563 2.275 1.02656 2.475 1.22656L10 8.77656L17.55 1.22656C17.7333 1.04323 17.9583 0.951562 18.225 0.951562C18.4917 0.951562 18.725 1.05156 18.925 1.25156C19.125 1.45156 19.225 1.6849 19.225 1.95156C19.225 2.21823 19.125 2.45156 18.925 2.65156Z"
                  fill="#002145"
                />
              </svg>
            </span>

            <!-- paragraph -->
            <p class="text-base-500 col-span-8 mx-auto w-10/12">
              تگ h نشان دهنده سرفصل های صفحه وب است. تگ h1 مهمترین تگ h است و
              موضوع اصلی صفحه را توصیف می کند، در حالی که بقیه تگ ها موضوعات
              فرعی صفحه وب را توصیف می کنند.
            </p>
          </div>

          <hr />

          <!-- this must designed as widget -->
          <div class="grid grid-cols-8 items-start gap-5 w-full">
            <!-- title -->
            <div class="flex flex-row items-center gap-4 col-span-2">
              <span class="mask mask-triangle w-6 h-6 bg-success">&nbsp;</span>
              <span>{{
                config.by_route(`${technical_section}/content-keywords`)
              }}</span>
            </div>

            <!-- description -->
            <div class="flex flex-col gap-2 font-thin col-span-5">
              <p>محتوا دارای کلمات کلیدی مرتبط است.</p>
              <div class="flex flex-row items-center gap-2">
                <span class="rounded-lg px-3 py-2 text-primary bg-primary/20">
                  سئو
                </span>
                <span class="rounded-lg px-3 py-2 text-primary bg-primary/20">
                  آموزش سئو
                </span>
                <span class="rounded-lg px-3 py-2 text-primary bg-primary/20">
                  سگمنتو
                </span>
                <span class="rounded-lg px-3 py-2 text-primary bg-primary/20">
                  آموزش سئو مشهد
                </span>
              </div>
            </div>

            <!-- spinner -->
            <span class="h-full flex items-center justify-end">
              <svg
                width="20"
                height="12"
                viewBox="0 0 20 12"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M18.925 2.65156L10.625 10.9766C10.5417 11.0599 10.4457 11.1222 10.337 11.1636C10.229 11.2056 10.1167 11.2266 10 11.2266C9.88333 11.2266 9.77067 11.2056 9.662 11.1636C9.554 11.1222 9.45833 11.0599 9.375 10.9766L1.05 2.65156C0.85 2.45156 0.75 2.21823 0.75 1.95156C0.75 1.6849 0.858333 1.44323 1.075 1.22656C1.25833 1.02656 1.48733 0.926563 1.762 0.926563C2.03733 0.926563 2.275 1.02656 2.475 1.22656L10 8.77656L17.55 1.22656C17.7333 1.04323 17.9583 0.951562 18.225 0.951562C18.4917 0.951562 18.725 1.05156 18.925 1.25156C19.125 1.45156 19.225 1.6849 19.225 1.95156C19.225 2.21823 19.125 2.45156 18.925 2.65156Z"
                  fill="#002145"
                />
              </svg>
            </span>
            <!-- paragraph -->
            <p class="text-base-500 col-span-8 w-10/12 mx-auto">
              محتوای صفحه وب باید حاوی کلمات کلیدی مرتبط باشد که در عنوان صفحه
              وب نیز یافت می شود.
            </p>
          </div>
        </div>
      </section>

      <!-- chart section -->
      <section
        class="w-full border rounded-sm flex flex-col gap-5 pt-2 pb-4 px-4"
      >
        <!-- haeder -->
        <div class="flex flex-row items-center justify-between">
          <!-- title -->
          <span>
            {{ config.by_route(`${chart_section}/title`) }}
          </span>

          <!-- options -->
          <span class="flex flex-row gap-2">
            <button
              class="rounded-lg bg-base-250 w-10 h-10 flex flex-col items-center transition-all duration-200 hover:bg-base-350"
            >
              <svg
                class="my-auto"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <mask
                  id="mask0_929_1095"
                  style="mask-type: alpha"
                  maskUnits="userSpaceOnUse"
                  x="0"
                  y="0"
                  width="24"
                  height="24"
                >
                  <rect width="24" height="24" fill="#D9D9D9" />
                </mask>
                <g mask="url(#mask0_929_1095)">
                  <path
                    d="M6 19.75C5.51667 19.75 5.10433 19.5793 4.763 19.238C4.421 18.896 4.25 18.4833 4.25 18V11C4.25 10.5167 4.421 10.104 4.763 9.762C5.10433 9.42067 5.51667 9.25 6 9.25C6.48333 9.25 6.896 9.42067 7.238 9.762C7.57933 10.104 7.75 10.5167 7.75 11V18C7.75 18.4833 7.57933 18.896 7.238 19.238C6.896 19.5793 6.48333 19.75 6 19.75ZM12 19.75C11.5167 19.75 11.104 19.5793 10.762 19.238C10.4207 18.896 10.25 18.4833 10.25 18V6C10.25 5.51667 10.4207 5.104 10.762 4.762C11.104 4.42067 11.5167 4.25 12 4.25C12.4833 4.25 12.896 4.42067 13.238 4.762C13.5793 5.104 13.75 5.51667 13.75 6V18C13.75 18.4833 13.5793 18.896 13.238 19.238C12.896 19.5793 12.4833 19.75 12 19.75ZM18 19.75C17.5167 19.75 17.1043 19.5793 16.763 19.238C16.421 18.896 16.25 18.4833 16.25 18V15C16.25 14.5167 16.421 14.104 16.763 13.762C17.1043 13.4207 17.5167 13.25 18 13.25C18.4833 13.25 18.896 13.4207 19.238 13.762C19.5793 14.104 19.75 14.5167 19.75 15V18C19.75 18.4833 19.5793 18.896 19.238 19.238C18.896 19.5793 18.4833 19.75 18 19.75Z"
                    fill="#488CDA"
                  />
                </g>
              </svg>
            </button>
            <button
              class="rounded-lg bg-base-250 w-10 h-10 flex flex-col items-center transition-all duration-200 hover:bg-base-350"
            >
              <svg
                class="my-auto"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <mask
                  id="mask0_929_1151"
                  style="mask-type: alpha"
                  maskUnits="userSpaceOnUse"
                  x="0"
                  y="0"
                  width="24"
                  height="24"
                >
                  <rect width="24" height="24" fill="#D9D9D9" />
                </mask>
                <g mask="url(#mask0_929_1151)">
                  <path
                    d="M3 17.5C2.51667 17.5 2.104 17.3293 1.762 16.988C1.42067 16.646 1.25 16.2333 1.25 15.75C1.25 15.2667 1.42067 14.854 1.762 14.512C2.104 14.1707 2.51667 14 3 14C3.11667 14 3.22067 14.004 3.312 14.012C3.404 14.0207 3.49167 14.05 3.575 14.1L8.35 9.325C8.3 9.24167 8.27067 9.154 8.262 9.062C8.254 8.97067 8.25 8.86667 8.25 8.75C8.25 8.26667 8.42067 7.854 8.762 7.512C9.104 7.17067 9.51667 7 10 7C10.4833 7 10.896 7.17067 11.238 7.512C11.5793 7.854 11.75 8.26667 11.75 8.75C11.75 8.81667 11.7167 9 11.65 9.3L14.45 12.1C14.5333 12.05 14.6167 12.0207 14.7 12.012C14.7833 12.004 14.8833 12 15 12C15.1167 12 15.2167 12.004 15.3 12.012C15.3833 12.0207 15.4667 12.05 15.55 12.1L19.35 8.3C19.3 8.21667 19.271 8.13333 19.263 8.05C19.2543 7.96667 19.25 7.86667 19.25 7.75C19.25 7.26667 19.421 6.854 19.763 6.512C20.1043 6.17067 20.5167 6 21 6C21.4833 6 21.896 6.17067 22.238 6.512C22.5793 6.854 22.75 7.26667 22.75 7.75C22.75 8.23333 22.5793 8.646 22.238 8.988C21.896 9.32933 21.4833 9.5 21 9.5C20.8833 9.5 20.7833 9.496 20.7 9.488C20.6167 9.47933 20.5333 9.45 20.45 9.4L16.65 13.2C16.7 13.2833 16.7293 13.3667 16.738 13.45C16.746 13.5333 16.75 13.6333 16.75 13.75C16.75 14.2333 16.5793 14.646 16.238 14.988C15.896 15.3293 15.4833 15.5 15 15.5C14.5167 15.5 14.104 15.3293 13.762 14.988C13.4207 14.646 13.25 14.2333 13.25 13.75C13.25 13.6333 13.254 13.5293 13.262 13.438C13.2707 13.346 13.3 13.2583 13.35 13.175L10.575 10.4C10.4917 10.45 10.404 10.4793 10.312 10.488C10.2207 10.496 10.1167 10.5 10 10.5C9.93333 10.5 9.75 10.4667 9.45 10.4L4.65 15.2C4.7 15.2833 4.72933 15.3667 4.738 15.45C4.746 15.5333 4.75 15.6333 4.75 15.75C4.75 16.2333 4.579 16.646 4.237 16.988C3.89567 17.3293 3.48333 17.5 3 17.5Z"
                    fill="#488CDA"
                  />
                </g>
              </svg>
            </button>
          </span>
        </div>

        <!-- the chart -->
        <div class="flex flex-row items-center justify-center w-11/12">
          <!-- data not found -->
          <div class="flex flex-col gap-4 items-center justify-center h-96">
            <img src="/images/question.png" class="w-44 h-44" alt="not found" />
            <span>
              {{ config.by_route(`${chart_section}/empty`) }}
            </span>

            <button class="btn btn-primary mt-2 px-4">
              <span>
                <svg
                  width="14"
                  height="14"
                  viewBox="0 0 14 14"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M7 13.75C6.78333 13.75 6.60433 13.6793 6.463 13.538C6.321 13.396 6.25 13.2167 6.25 13V7.75H1C0.783333 7.75 0.604333 7.679 0.463 7.537C0.321 7.39567 0.25 7.21667 0.25 7C0.25 6.78333 0.321 6.604 0.463 6.462C0.604333 6.32067 0.783333 6.25 1 6.25H6.25V1C6.25 0.783333 6.321 0.604333 6.463 0.463C6.60433 0.321 6.78333 0.25 7 0.25C7.21667 0.25 7.396 0.321 7.538 0.463C7.67933 0.604333 7.75 0.783333 7.75 1V6.25H13C13.2167 6.25 13.396 6.32067 13.538 6.462C13.6793 6.604 13.75 6.78333 13.75 7C13.75 7.21667 13.6793 7.39567 13.538 7.537C13.396 7.679 13.2167 7.75 13 7.75H7.75V13C7.75 13.2167 7.67933 13.396 7.538 13.538C7.396 13.6793 7.21667 13.75 7 13.75Z"
                    fill="white"
                  />
                </svg>
              </span>
              <span>
                {{ config.by_route(`${chart_section}/button`) }}
              </span>
            </button>
          </div>
        </div>
      </section>

      <!-- filter section -->
      <section
        class="w-full border rounded-lg flex flex-row items-center gap-2 py-4 px-2 shadow-md"
      >
        <!-- this must be sets as dropdown component -->
        <div
          class="flex items-center justify-between px-3 py-2 border rounded-md w-2/5"
        >
          <span>
            {{ config.by_route(`${filter_section}/option`) }}
          </span>
          <span
            ><svg
              width="20"
              height="12"
              viewBox="0 0 20 12"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M18.9386 2.70625L10.6347 11.0255C10.5411 11.1191 10.4424 11.1851 10.3386 11.2236C10.2347 11.262 10.1226 11.2813 10.002 11.2813C9.88152 11.2813 9.76935 11.262 9.66551 11.2236C9.56166 11.1851 9.46294 11.1191 9.36936 11.0255L1.04051 2.69665C0.852046 2.50818 0.757813 2.27742 0.757813 2.00435C0.757813 1.73128 0.860379 1.49218 1.06551 1.28705C1.26423 1.08833 1.4982 0.988976 1.76741 0.988976C2.03665 0.988976 2.27062 1.08833 2.46934 1.28705L10.002 8.81975L17.5444 1.27745C17.7328 1.08898 17.961 0.994751 18.229 0.994751C18.4969 0.994751 18.7334 1.09732 18.9386 1.30245C19.1373 1.50115 19.2366 1.73512 19.2366 2.00435C19.2366 2.27358 19.1373 2.50755 18.9386 2.70625Z"
                fill="#002145"
              />
            </svg>
          </span>
        </div>
        <span>
          {{ config.by_route(`${filter_section}/order`) }}
        </span>
        <!-- this must be sets as dropdown component -->
        <div
          class="flex items-center justify-between px-3 py-2 border rounded-md w-2/5"
        >
          <span>
            {{ config.by_route(`${filter_section}/option`) }}
          </span>
          <span
            ><svg
              width="20"
              height="12"
              viewBox="0 0 20 12"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M18.9386 2.70625L10.6347 11.0255C10.5411 11.1191 10.4424 11.1851 10.3386 11.2236C10.2347 11.262 10.1226 11.2813 10.002 11.2813C9.88152 11.2813 9.76935 11.262 9.66551 11.2236C9.56166 11.1851 9.46294 11.1191 9.36936 11.0255L1.04051 2.69665C0.852046 2.50818 0.757813 2.27742 0.757813 2.00435C0.757813 1.73128 0.860379 1.49218 1.06551 1.28705C1.26423 1.08833 1.4982 0.988976 1.76741 0.988976C2.03665 0.988976 2.27062 1.08833 2.46934 1.28705L10.002 8.81975L17.5444 1.27745C17.7328 1.08898 17.961 0.994751 18.229 0.994751C18.4969 0.994751 18.7334 1.09732 18.9386 1.30245C19.1373 1.50115 19.2366 1.73512 19.2366 2.00435C19.2366 2.27358 19.1373 2.50755 18.9386 2.70625Z"
                fill="#002145"
              />
            </svg>
          </span>
        </div>
        <button class="btn-primary w-12">
          <svg
            width="18"
            height="18"
            viewBox="0 0 18 18"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M16.0234 17.05L10.2484 11.3C9.74844 11.7167 9.17344 12.0417 8.52344 12.275C7.87344 12.5083 7.20677 12.625 6.52344 12.625C4.80677 12.625 3.35677 12.0333 2.17344 10.85C0.990104 9.66667 0.398438 8.21667 0.398438 6.5C0.398438 4.8 0.990104 3.354 2.17344 2.162C3.35677 0.970667 4.80677 0.375 6.52344 0.375C8.22344 0.375 9.6651 0.966667 10.8484 2.15C12.0318 3.33333 12.6234 4.78333 12.6234 6.5C12.6234 7.21667 12.5068 7.9 12.2734 8.55C12.0401 9.2 11.7234 9.76667 11.3234 10.25L17.0984 16.025C17.2318 16.1583 17.2984 16.325 17.2984 16.525C17.2984 16.725 17.2234 16.9 17.0734 17.05C16.9234 17.2 16.7444 17.275 16.5364 17.275C16.3278 17.275 16.1568 17.2 16.0234 17.05ZM6.52344 11.125C7.80677 11.125 8.89444 10.675 9.78644 9.775C10.6778 8.875 11.1234 7.78333 11.1234 6.5C11.1234 5.21667 10.6778 4.125 9.78644 3.225C8.89444 2.325 7.80677 1.875 6.52344 1.875C5.22344 1.875 4.12777 2.325 3.23644 3.225C2.34444 4.125 1.89844 5.21667 1.89844 6.5C1.89844 7.78333 2.34444 8.875 3.23644 9.775C4.12777 10.675 5.22344 11.125 6.52344 11.125Z"
              fill="white"
            />
          </svg>
        </button>
      </section>
    </div>
  </div>
</template>

<script setup>
import Config from "../../composables/Config";

const current_page = "pages/money-pages/single";
const technical_section = `${current_page}/sections/technical-analysis`;
const chart_section = `${current_page}/sections/chart`;
const filter_section = `${current_page}/sections/filter`;

const config = new Config();
</script>