<template xmlns="http://www.w3.org/1999/html">
  <div class="container px-2">
    <div class="notice flex flex-col gap-4">
      <h1 class="text-[#7D7D7D]">لطفا به نکات زیر توجه کنید: </h1>
      <p class="text-[#7D7D7D]">نمونه متن برای نوشتن نکات مهم برای بخش کیف پول میباشد نظیر سقف و کف های برداشت و شارژ
        کیف پول</p>
      <p class="text-[#7D7D7D]">نمونه متن برای نوشتن نکات مهم برای بخش کیف پول میباشد نظیر سقف و کف های برداشت و شارژ
        کیف پول</p>
      <p class="text-[#7D7D7D]">نمونه متن برای نوشتن نکات مهم برای بخش کیف پول میباشد نظیر سقف و کف های برداشت و شارژ
        کیف پول</p>
      <p class="text-[#7D7D7D]">نمونه متن برای نوشتن نکات مهم برای بخش کیف پول میباشد نظیر سقف و کف های برداشت و شارژ
        کیف پول</p>
      <p class="text-[#7D7D7D]">نمونه متن برای نوشتن نکات مهم برای بخش کیف پول میباشد نظیر سقف و کف های برداشت و شارژ
        کیف پول</p>
    </div>
    <div class="content py-2">
      <span class="flex items-center gap-2.5 p-2.5 w-max">
        <div class="circle w-[19px] h-[19px] rounded-[50%] bg-[#0A65CD] flex justify-center items-center">
          <div class="child flow-root w-[10px] h-[10px] rounded-[50%] bg-[white] border-solid"></div>
        </div>
        فایل ساز ربات
            <div class="helper">
        <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
          <mask id="mask0_28_1173" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="14"
                height="14">
            <rect width="14" height="14" fill="#D9D9D9"/>
          </mask>
          <g mask="url(#mask0_28_1173)">
            <path
              d="M7.0026 10.2839C7.16788 10.2839 7.30652 10.2255 7.41852 10.1089C7.53013 9.99219 7.58594 9.85122 7.58594 9.68594C7.58594 9.52066 7.53013 9.37969 7.41852 9.26302C7.30652 9.14635 7.16788 9.08802 7.0026 9.08802C6.8276 9.08802 6.6843 9.14635 6.57269 9.26302C6.46069 9.37969 6.40469 9.52066 6.40469 9.68594C6.40469 9.85122 6.46069 9.99219 6.57269 10.1089C6.6843 10.2255 6.8276 10.2839 7.0026 10.2839ZM7.04635 4.50885C7.34774 4.50885 7.58827 4.58897 7.76794 4.74919C7.94799 4.9098 8.03802 5.12622 8.03802 5.39844C8.03802 5.57344 7.98688 5.74591 7.8846 5.91585C7.78272 6.08619 7.62969 6.26372 7.42552 6.44844C7.14358 6.69149 6.93941 6.9223 6.81302 7.14085C6.68663 7.3598 6.61858 7.58594 6.60885 7.81927C6.59913 7.91649 6.63316 8.00146 6.71094 8.07419C6.78871 8.1473 6.88108 8.18385 6.98802 8.18385C7.09497 8.18385 7.18985 8.1473 7.27269 8.07419C7.35513 8.00146 7.40608 7.91163 7.42552 7.80469C7.45469 7.63941 7.51788 7.48619 7.6151 7.34502C7.71233 7.20424 7.86788 7.02691 8.08177 6.81302C8.38316 6.53108 8.59219 6.2783 8.70885 6.05469C8.82552 5.83108 8.88385 5.58802 8.88385 5.32552C8.88385 4.85885 8.71372 4.47716 8.37344 4.18044C8.03316 3.8841 7.59566 3.73594 7.06094 3.73594C6.70122 3.73594 6.37066 3.81119 6.06927 3.96169C5.76788 4.11258 5.52969 4.33872 5.35469 4.6401C5.30608 4.73733 5.28916 4.83222 5.30394 4.92477C5.31833 5.01694 5.37413 5.09219 5.47135 5.15052C5.55885 5.20885 5.66347 5.2283 5.78519 5.20885C5.90652 5.18941 6.00608 5.12622 6.08385 5.01927C6.20052 4.86372 6.3343 4.73966 6.48519 4.6471C6.63569 4.55494 6.82274 4.50885 7.04635 4.50885ZM7.0026 12.5443C6.23455 12.5443 5.5151 12.3984 4.84427 12.1068C4.17344 11.8151 3.58758 11.4214 3.08669 10.9255C2.58619 10.4297 2.1901 9.84383 1.89844 9.16794C1.60677 8.49244 1.46094 7.77066 1.46094 7.0026C1.46094 6.23455 1.60677 5.51258 1.89844 4.83669C2.1901 4.16119 2.58619 3.57552 3.08669 3.07969C3.58758 2.58385 4.17344 2.1901 4.84427 1.89844C5.5151 1.60677 6.23455 1.46094 7.0026 1.46094C7.78038 1.46094 8.50469 1.60677 9.17552 1.89844C9.84635 2.1901 10.4322 2.58385 10.9331 3.07969C11.4336 3.57552 11.8274 4.16119 12.1144 4.83669C12.401 5.51258 12.5443 6.23455 12.5443 7.0026C12.5443 7.77066 12.401 8.49244 12.1144 9.16794C11.8274 9.84383 11.4336 10.4297 10.9331 10.9255C10.4322 11.4214 9.84635 11.8151 9.17552 12.1068C8.50469 12.3984 7.78038 12.5443 7.0026 12.5443ZM7.0026 11.6693C8.30538 11.6693 9.40885 11.2149 10.313 10.306C11.2172 9.3968 11.6693 8.29566 11.6693 7.0026C11.6693 5.70955 11.2172 4.60841 10.313 3.69919C9.40885 2.79035 8.30538 2.33594 7.0026 2.33594C5.71927 2.33594 4.62066 2.79035 3.70677 3.69919C2.79288 4.60841 2.33594 5.70955 2.33594 7.0026C2.33594 8.29566 2.79288 9.3968 3.70677 10.306C4.62066 11.2149 5.71927 11.6693 7.0026 11.6693Z"
              fill="#002145"/>
          </g>
        </svg>
      </div>
      </span>
      <!--box-->
      <div class="boxContent border border-solid border-[#D9D9D9] p-3.5 rounded-[9px] flex gap-8">
        <div class="robots flex flex-col gap-4  w-full relative">
          <h1 class="title flex items-center gap-2.5 pr-[18px] pt-2.5">
            <span class="before w-[2px] h-4 rounded-[15px] bg-[#0A65CD] absolute right-[-15px]"></span>
            انتخاب ربات موتور جستجو
          </h1>
          <div class="combo">
            <input-select class="border rounded-[2px]">
              <template v-slot:title>
                <span>شامل همه ربات موتورهای جستجو</span>
              </template>
              <template v-slot:content>
                <div class="parent flex ltr  items-center gap-[7px] w-full flex-col">
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">All Bots</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">APIs-Google</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">AdsBot Mobile Web Android</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">AdsBot Mobile Web</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">AdsBot</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">AdsSense</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">Googlebot Image</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">Googlebot News</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">Googlebot Video</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">Googlebot Desktop</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">Googlebot Smartphone</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoRobots">Bingbot</input-radio>
                    </div>
                  </div>
                </div>
              </template>
            </input-select>
          </div>
          <div
            class="resultBox h-[209px]  border border-dashed border-[#0A65CD] bg-[#fff9e8] rounded-[10px] p-2">
            <span class="flex items-center gap-1 text-[13px] ">
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                      <mask id="mask0_30_1381" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                            height="24">
                      <rect width="24" height="24" fill="#D9D9D9"/>
                      </mask>
                      <g mask="url(#mask0_30_1381)">
                      <path
                        d="M12 13.075C12.2167 13.075 12.396 13.004 12.538 12.862C12.6793 12.7207 12.75 12.5417 12.75 12.325V7.8C12.75 7.6 12.6793 7.429 12.538 7.287C12.396 7.14567 12.2167 7.075 12 7.075C11.7833 7.075 11.6043 7.14567 11.463 7.287C11.321 7.429 11.25 7.60833 11.25 7.825V12.35C11.25 12.55 11.321 12.7207 11.463 12.862C11.6043 13.004 11.7833 13.075 12 13.075ZM12 16.725C12.2333 16.725 12.425 16.65 12.575 16.5C12.725 16.35 12.8 16.1583 12.8 15.925C12.8 15.6917 12.725 15.5 12.575 15.35C12.425 15.2 12.2333 15.125 12 15.125C11.7667 15.125 11.575 15.2 11.425 15.35C11.275 15.5 11.2 15.6917 11.2 15.925C11.2 16.1583 11.275 16.35 11.425 16.5C11.575 16.65 11.7667 16.725 12 16.725ZM12 21.5C10.6833 21.5 9.446 21.25 8.288 20.75C7.12933 20.25 6.125 19.575 5.275 18.725C4.425 17.875 3.75 16.8707 3.25 15.712C2.75 14.554 2.5 13.3167 2.5 12C2.5 10.6833 2.75 9.44567 3.25 8.287C3.75 7.129 4.425 6.125 5.275 5.275C6.125 4.425 7.12933 3.75 8.288 3.25C9.446 2.75 10.6833 2.5 12 2.5C13.3167 2.5 14.5543 2.75 15.713 3.25C16.871 3.75 17.875 4.425 18.725 5.275C19.575 6.125 20.25 7.129 20.75 8.287C21.25 9.44567 21.5 10.6833 21.5 12C21.5 13.3167 21.25 14.554 20.75 15.712C20.25 16.8707 19.575 17.875 18.725 18.725C17.875 19.575 16.871 20.25 15.713 20.75C14.5543 21.25 13.3167 21.5 12 21.5ZM12 20C14.2167 20 16.1043 19.221 17.663 17.663C19.221 16.1043 20 14.2167 20 12C20 9.78333 19.221 7.89567 17.663 6.337C16.1043 4.779 14.2167 4 12 4C9.78333 4 7.896 4.779 6.338 6.337C4.77933 7.89567 4 9.78333 4 12C4 14.2167 4.77933 16.1043 6.338 17.663C7.896 19.221 9.78333 20 12 20Z"
                        fill="#FFCE47"/>
                      </g>
                      </svg>
              </div>
              1.خود این آدرس
            </span>
            <span class="text-[13px] px-[30px]">2.تمام آدرس های بعد از آن خزش نشود</span>
          </div>
          <div
            class="resultBox h-[209px] border border-dashed border-[#0A65CD] bg-[#fff9e8] rounded-[10px] p-2">
            <span class="flex items-center gap-1 text-[13px] ">
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                      <mask id="mask0_30_1381" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                            height="24">
                      <rect width="24" height="24" fill="#D9D9D9"/>
                      </mask>
                      <g mask="url(#mask0_30_1381)">
                      <path
                        d="M12 13.075C12.2167 13.075 12.396 13.004 12.538 12.862C12.6793 12.7207 12.75 12.5417 12.75 12.325V7.8C12.75 7.6 12.6793 7.429 12.538 7.287C12.396 7.14567 12.2167 7.075 12 7.075C11.7833 7.075 11.6043 7.14567 11.463 7.287C11.321 7.429 11.25 7.60833 11.25 7.825V12.35C11.25 12.55 11.321 12.7207 11.463 12.862C11.6043 13.004 11.7833 13.075 12 13.075ZM12 16.725C12.2333 16.725 12.425 16.65 12.575 16.5C12.725 16.35 12.8 16.1583 12.8 15.925C12.8 15.6917 12.725 15.5 12.575 15.35C12.425 15.2 12.2333 15.125 12 15.125C11.7667 15.125 11.575 15.2 11.425 15.35C11.275 15.5 11.2 15.6917 11.2 15.925C11.2 16.1583 11.275 16.35 11.425 16.5C11.575 16.65 11.7667 16.725 12 16.725ZM12 21.5C10.6833 21.5 9.446 21.25 8.288 20.75C7.12933 20.25 6.125 19.575 5.275 18.725C4.425 17.875 3.75 16.8707 3.25 15.712C2.75 14.554 2.5 13.3167 2.5 12C2.5 10.6833 2.75 9.44567 3.25 8.287C3.75 7.129 4.425 6.125 5.275 5.275C6.125 4.425 7.12933 3.75 8.288 3.25C9.446 2.75 10.6833 2.5 12 2.5C13.3167 2.5 14.5543 2.75 15.713 3.25C16.871 3.75 17.875 4.425 18.725 5.275C19.575 6.125 20.25 7.129 20.75 8.287C21.25 9.44567 21.5 10.6833 21.5 12C21.5 13.3167 21.25 14.554 20.75 15.712C20.25 16.8707 19.575 17.875 18.725 18.725C17.875 19.575 16.871 20.25 15.713 20.75C14.5543 21.25 13.3167 21.5 12 21.5ZM12 20C14.2167 20 16.1043 19.221 17.663 17.663C19.221 16.1043 20 14.2167 20 12C20 9.78333 19.221 7.89567 17.663 6.337C16.1043 4.779 14.2167 4 12 4C9.78333 4 7.896 4.779 6.338 6.337C4.77933 7.89567 4 9.78333 4 12C4 14.2167 4.77933 16.1043 6.338 17.663C7.896 19.221 9.78333 20 12 20Z"
                        fill="#FFCE47"/>
                      </g>
                      </svg>
              </div>
              1.خود این آدرس
            </span>
            <span class="text-[13px] px-[30px]">2.تمام آدرس های بعد از آن خزش نشود</span>
          </div>
        </div>
        <div class="border h-[550px]"></div>
        <!--robots-->
        <div class="behavior flex flex-col w-full pt-2.5 gap-4 relative">
          <h1 class="title flex items-center gap-2.5">
            <span class="before w-[2px] h-4 rounded-[15px] bg-[#0A65CD] absolute right-[-34px]"></span>
            انتخاب نوع رفتار ربات
          </h1>

          <div class="combo">
            <input-select class="border rounded-[2px]">
              <template v-slot:title>
                <span>مجاز</span>
              </template>
              <template v-slot:content>
                <div class="parent flex  items-center gap-[7px] w-full flex-col cursor-pointer">
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoPermission">مجاز</input-radio>
                    </div>
                  </div>
                  <div class="w-full">
                    <div class="w-max">
                      <input-radio name="rdoPermission">منع</input-radio>
                    </div>
                  </div>
                </div>
              </template>
            </input-select>
          </div>

          <div class="links">
            <div class="flex flex-col gap-2.5">
              <div class="flex flex-col gap-1">
                <span class="text-[#002145] text-[12px] font-normal px-2.5 ">درج لینک</span>
                <div class="flex items-center align-center gap-5 relative">
                  <InputText
                    type="text"
                    class="h-max py-[10px]"
                  />
                  <div class="add bg-[#F2F5F7] p-1 rounded-[3px] absolute left-[50px] cursor-pointer">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="25" viewBox="0 0 24 25" fill="none">
                      <mask id="mask0_36_60" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                            height="25">
                        <rect y="0.5" width="24" height="24" fill="#D9D9D9"/>
                      </mask>
                      <g mask="url(#mask0_36_60)">
                        <path
                          d="M12 19.25C11.7833 19.25 11.6043 19.1793 11.463 19.038C11.321 18.896 11.25 18.7167 11.25 18.5V13.25H6C5.78333 13.25 5.60433 13.179 5.463 13.037C5.321 12.8957 5.25 12.7167 5.25 12.5C5.25 12.2833 5.321 12.104 5.463 11.962C5.60433 11.8207 5.78333 11.75 6 11.75H11.25V6.5C11.25 6.28333 11.321 6.10433 11.463 5.963C11.6043 5.821 11.7833 5.75 12 5.75C12.2167 5.75 12.396 5.821 12.538 5.963C12.6793 6.10433 12.75 6.28333 12.75 6.5V11.75H18C18.2167 11.75 18.396 11.8207 18.538 11.962C18.6793 12.104 18.75 12.2833 18.75 12.5C18.75 12.7167 18.6793 12.8957 18.538 13.037C18.396 13.179 18.2167 13.25 18 13.25H12.75V18.5C12.75 18.7167 12.6793 18.896 12.538 19.038C12.396 19.1793 12.2167 19.25 12 19.25Z"
                          fill="#488CDA"/>
                      </g>
                    </svg>
                  </div>
                  <span class="delete cursor-pointer">
              <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <mask id="mask0_28_2147" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                      height="24">
                <rect width="24" height="24" fill="#D9D9D9"/>
                </mask>
                <g mask="url(#mask0_28_2147)">
                <path
                  d="M11.9984 13.0484L6.92344 18.1234C6.7901 18.2568 6.61944 18.3274 6.41144 18.3354C6.20277 18.3441 6.02344 18.2734 5.87344 18.1234C5.72344 17.9734 5.64844 17.7984 5.64844 17.5984C5.64844 17.3984 5.72344 17.2234 5.87344 17.0734L10.9484 11.9984L5.87344 6.92344C5.7401 6.7901 5.66944 6.6191 5.66144 6.41044C5.65277 6.20244 5.72344 6.02344 5.87344 5.87344C6.02344 5.72344 6.19844 5.64844 6.39844 5.64844C6.59844 5.64844 6.77344 5.72344 6.92344 5.87344L11.9984 10.9484L17.0734 5.87344C17.2068 5.7401 17.3778 5.6691 17.5864 5.66044C17.7944 5.65244 17.9734 5.72344 18.1234 5.87344C18.2734 6.02344 18.3484 6.19844 18.3484 6.39844C18.3484 6.59844 18.2734 6.77344 18.1234 6.92344L13.0484 11.9984L18.1234 17.0734C18.2568 17.2068 18.3274 17.3774 18.3354 17.5854C18.3441 17.7941 18.2734 17.9734 18.1234 18.1234C17.9734 18.2734 17.7984 18.3484 17.5984 18.3484C17.3984 18.3484 17.2234 18.2734 17.0734 18.1234L11.9984 13.0484Z"
                  fill="#F35242"/>
                </g>
                <path
                  d="M0 3C0 1.34315 1.34315 0 3 0H21C22.6569 0 24 1.34315 24 3V21C24 22.6569 22.6569 24 21 24H3C1.34315 24 0 22.6569 0 21V3Z"
                  fill="#F35242" fill-opacity="0.1"/>
                </svg>

            </span>
                </div>
              </div>
              <div class="flex flex-col gap-1">
                <span class="text-[#002145] text-[12px] font-normal px-2.5">درج لینک</span>
                <div class="flex items-center align-center gap-5 relative">
                  <InputText
                    type="text"
                    class="h-max py-[10px]"
                  />
                  <div class="add bg-[#F2F5F7] p-1 rounded-[3px] absolute left-[50px] cursor-pointer">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="25" viewBox="0 0 24 25" fill="none">
                      <mask id="mask0_36_60" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                            height="25">
                        <rect y="0.5" width="24" height="24" fill="#D9D9D9"/>
                      </mask>
                      <g mask="url(#mask0_36_60)">
                        <path
                          d="M12 19.25C11.7833 19.25 11.6043 19.1793 11.463 19.038C11.321 18.896 11.25 18.7167 11.25 18.5V13.25H6C5.78333 13.25 5.60433 13.179 5.463 13.037C5.321 12.8957 5.25 12.7167 5.25 12.5C5.25 12.2833 5.321 12.104 5.463 11.962C5.60433 11.8207 5.78333 11.75 6 11.75H11.25V6.5C11.25 6.28333 11.321 6.10433 11.463 5.963C11.6043 5.821 11.7833 5.75 12 5.75C12.2167 5.75 12.396 5.821 12.538 5.963C12.6793 6.10433 12.75 6.28333 12.75 6.5V11.75H18C18.2167 11.75 18.396 11.8207 18.538 11.962C18.6793 12.104 18.75 12.2833 18.75 12.5C18.75 12.7167 18.6793 12.8957 18.538 13.037C18.396 13.179 18.2167 13.25 18 13.25H12.75V18.5C12.75 18.7167 12.6793 18.896 12.538 19.038C12.396 19.1793 12.2167 19.25 12 19.25Z"
                          fill="#488CDA"/>
                      </g>
                    </svg>
                  </div>
                  <span class="delete cursor-pointer">
              <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <mask id="mask0_28_2147" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                      height="24">
                <rect width="24" height="24" fill="#D9D9D9"/>
                </mask>
                <g mask="url(#mask0_28_2147)">
                <path
                  d="M11.9984 13.0484L6.92344 18.1234C6.7901 18.2568 6.61944 18.3274 6.41144 18.3354C6.20277 18.3441 6.02344 18.2734 5.87344 18.1234C5.72344 17.9734 5.64844 17.7984 5.64844 17.5984C5.64844 17.3984 5.72344 17.2234 5.87344 17.0734L10.9484 11.9984L5.87344 6.92344C5.7401 6.7901 5.66944 6.6191 5.66144 6.41044C5.65277 6.20244 5.72344 6.02344 5.87344 5.87344C6.02344 5.72344 6.19844 5.64844 6.39844 5.64844C6.59844 5.64844 6.77344 5.72344 6.92344 5.87344L11.9984 10.9484L17.0734 5.87344C17.2068 5.7401 17.3778 5.6691 17.5864 5.66044C17.7944 5.65244 17.9734 5.72344 18.1234 5.87344C18.2734 6.02344 18.3484 6.19844 18.3484 6.39844C18.3484 6.59844 18.2734 6.77344 18.1234 6.92344L13.0484 11.9984L18.1234 17.0734C18.2568 17.2068 18.3274 17.3774 18.3354 17.5854C18.3441 17.7941 18.2734 17.9734 18.1234 18.1234C17.9734 18.2734 17.7984 18.3484 17.5984 18.3484C17.3984 18.3484 17.2234 18.2734 17.0734 18.1234L11.9984 13.0484Z"
                  fill="#F35242"/>
                </g>
                <path
                  d="M0 3C0 1.34315 1.34315 0 3 0H21C22.6569 0 24 1.34315 24 3V21C24 22.6569 22.6569 24 21 24H3C1.34315 24 0 22.6569 0 21V3Z"
                  fill="#F35242" fill-opacity="0.1"/>
                </svg>

            </span>
                </div>
              </div>
            </div>
            <button
              class="addBtn py-[8px] px-[20px] my-[15px] rounded-[9px] float-left bg-[#F2F5F7] text-[#488CDA] text-sm flex gap-2.5 align-center items-center">
              <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <mask id="mask0_36_16" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                      height="24">
                  <rect width="24" height="24" fill="#D9D9D9"/>
                </mask>
                <g mask="url(#mask0_36_16)">
                  <path
                    d="M12 18.75C11.7833 18.75 11.6043 18.6793 11.463 18.538C11.321 18.396 11.25 18.2167 11.25 18V12.75H6C5.78333 12.75 5.60433 12.679 5.463 12.537C5.321 12.3957 5.25 12.2167 5.25 12C5.25 11.7833 5.321 11.604 5.463 11.462C5.60433 11.3207 5.78333 11.25 6 11.25H11.25V6C11.25 5.78333 11.321 5.60433 11.463 5.463C11.6043 5.321 11.7833 5.25 12 5.25C12.2167 5.25 12.396 5.321 12.538 5.463C12.6793 5.60433 12.75 5.78333 12.75 6V11.25H18C18.2167 11.25 18.396 11.3207 18.538 11.462C18.6793 11.604 18.75 11.7833 18.75 12C18.75 12.2167 18.6793 12.3957 18.538 12.537C18.396 12.679 18.2167 12.75 18 12.75H12.75V18C12.75 18.2167 12.6793 18.396 12.538 18.538C12.396 18.6793 12.2167 18.75 12 18.75Z"
                    fill="#488CDA"/>
                </g>
              </svg>
              افزدون لینک
            </button>
          </div>
          <div
            class="resultBox h-[209px] border border-solid border-base-400 bg-[#FCFCFB] rounded-[5px] p-[15px] flex flex-col gap-2.5 ltr">
            <span>disallow: /dashboard*</span>
            <span>disallow: /dashboard*</span>
            <span>disallow: /dashboard*</span>
            <span>disallow: /dashboard*</span>
            <span>disallow: /dashboard*</span>
          </div>
          <div class="text-left flex flex-row-reverse gap-2.5">
            <button
              class="py-[8px] px-[20px] my-[15px] rounded-[9px]  bg-[#0A65CD] text-[#FFFFFF] text-sm flex gap-2.5 items-center">
              <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <mask id="mask0_36_80" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                      height="24">
                  <rect width="24" height="24" fill="#D9D9D9"/>
                </mask>
                <g mask="url(#mask0_36_80)">
                  <path
                    d="M12 15.25C11.8833 15.25 11.771 15.2293 11.663 15.188C11.5543 15.146 11.4583 15.075 11.375 14.975L8.25 11.875C8.11667 11.7416 8.05 11.5666 8.05 11.35C8.05 11.1333 8.11667 10.9583 8.25 10.825C8.4 10.675 8.579 10.5956 8.787 10.587C8.99567 10.579 9.175 10.65 9.325 10.8L11.25 12.725V5.07495C11.25 4.85828 11.321 4.67895 11.463 4.53695C11.6043 4.39562 11.7833 4.32495 12 4.32495C12.2167 4.32495 12.396 4.39562 12.538 4.53695C12.6793 4.67895 12.75 4.85828 12.75 5.07495V12.725L14.675 10.8C14.8083 10.6666 14.9833 10.6 15.2 10.6C15.4167 10.6 15.6 10.675 15.75 10.825C15.8833 10.9583 15.95 11.129 15.95 11.337C15.95 11.5456 15.8833 11.725 15.75 11.875L12.625 14.975C12.5417 15.075 12.446 15.146 12.338 15.188C12.2293 15.2293 12.1167 15.25 12 15.25ZM6.3 19.5C5.8 19.5 5.375 19.325 5.025 18.975C4.675 18.625 4.5 18.2 4.5 17.7V15.75C4.5 15.5333 4.571 15.354 4.713 15.212C4.85433 15.0706 5.03333 15 5.25 15C5.46667 15 5.64567 15.0706 5.787 15.212C5.929 15.354 6 15.5333 6 15.75V17.7C6 17.7666 6.03333 17.8333 6.1 17.9C6.16667 17.9666 6.23333 18 6.3 18H17.7C17.7667 18 17.8333 17.9666 17.9 17.9C17.9667 17.8333 18 17.7666 18 17.7V15.75C18 15.5333 18.0707 15.354 18.212 15.212C18.354 15.0706 18.5333 15 18.75 15C18.9667 15 19.146 15.0706 19.288 15.212C19.4293 15.354 19.5 15.5333 19.5 15.75V17.7C19.5 18.2 19.325 18.625 18.975 18.975C18.625 19.325 18.2 19.5 17.7 19.5H6.3Z"
                    fill="white"/>
                </g>
              </svg>
              دانلود
            </button>
            <button
              class="save py-[8px] px-[20px] my-[15px] rounded-[9px]  bg-[#F2F5F7] text-[#488CDA] flex gap-2.5 text-sm items-center">
              <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <mask id="mask0_36_47" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24"
                      height="24">
                  <rect width="24" height="24" fill="#D9D9D9"/>
                </mask>
                <g mask="url(#mask0_36_47)">
                  <path
                    d="M7 17.95L12 15.8L17 17.95V5.3C17 5.23333 16.9667 5.16667 16.9 5.1C16.8333 5.03333 16.7667 5 16.7 5H7.3C7.23333 5 7.16667 5.03333 7.1 5.1C7.03333 5.16667 7 5.23333 7 5.3V17.95ZM6.775 19.7C6.475 19.8333 6.18733 19.8123 5.912 19.637C5.63733 19.4623 5.5 19.2083 5.5 18.875V5.3C5.5 4.8 5.675 4.375 6.025 4.025C6.375 3.675 6.8 3.5 7.3 3.5H16.7C17.2 3.5 17.625 3.675 17.975 4.025C18.325 4.375 18.5 4.8 18.5 5.3V18.875C18.5 19.2083 18.3623 19.4623 18.087 19.637C17.8123 19.8123 17.525 19.8333 17.225 19.7L12 17.45L6.775 19.7Z"
                    fill="#488CDA"/>
                </g>
              </svg>
              ذخیره
            </button>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<style scoped>
.notice p::before {
  content: "";
  display: inline-block;
  width: 10px;
  height: 10px;
  border-radius: 50%;
  vertical-align: middle;
  background-color: #0A65CD;
  margin-left: 10px;
}
</style>
<script setup lang="ts">
import DropdownIndexTwo from "~/components/Dropdown/DropdownIndexTwo.vue";
</script>
